name: "audio_embedding"
backend: "python"
max_batch_size: 0

input [
  {
    name: "AUDIO"
    data_type: TYPE_FP32
    dims: [-1]
  },
  {
    name: "SAMPLE_RATE"
    data_type: TYPE_INT32
    dims: [1]
  }
]

output [
  {
    name: "EMBEDDING"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]

instance_group [
  {
    kind: KIND_CPU
  }
]
